Repository: Yves-Byiringiro/kigali-mall-ve1
Catalog: locale/*/LC_MESSAGES/django.po
Languages: rw

source: About
rw: Abo turibo

source: Contact Us
rw: Twandikire

source: PHONE
rw: Telephone

source: EMAIL
rw: Imeri

source: ADDRESS
rw: Aho Dukorera

source: Send Now!
rw: Ohereza

source: Help
rw: Ubufasha

source: Privacy and Policy
rw: Amategeko ngenderwaho

source: Terms and Conditions
rw: Amategeko n'amabwiriza

source: welcome,
rw: Murakaza neza

source: View site
rw: Sura urubuga

source: Documentation
rw: dokimantasiyo

source: Change password
rw: Hindura ijambo ry'ibanga

source: Log out
rw: Sohoka

source: Home
rw: Ahabanza

source: Please correct the error below.
rw: Mukosore ikosa rikurikira

source: Please correct the errors below.
rw: Mukosore amakosa akurikira

source: Forgotten your password or username?
rw: Wibagiwe ijambo ry'ibanga?

source: Log in
rw: Injira

source: Product
rw: Igicuruzwa

source: have been added to cart
rw: Byongewe mu bubiko

source: You can make Advertisement Here!!
rw: Mushobora kwamamaza Hano

source: Contact us
rw: Twandikire

source: About Us
rw: Abo turibo

source: Categories
rw: Ibyiciro

source: Shoes
rw: Inkweto

source: Bags
rw: Ibikapu

source: Laptops
rw: Mudasobwa

source: Smartphones
rw: Telefone

source: Home Furnitures
rw: Ibyo murugo

source: Information
rw: Amakuru

source: Privacy Policy
rw: Amategeko ngenderwaho

source: Terms & Conditions
rw: Amategeko n'amabwiriza

source: Services we offer
rw: Serivise dutanga

source: Advertisement
rw: Kwamamaza

source: Website development
rw: Gukora website

source: Hosting
rw: Kwandika website

source: Domain name registration
rw: Kwandika izina rya website

source: Welcome
rw: Murakaza neza

source: My Account
rw: Konti yanjye

source: Search here
rw: Shakira hano

source: Search
rw: Shaka

source: Your Wishlist
rw: Ibyo wifuza

source: Your Cart
rw: Ububiko

source: Item(s) selected
rw: Ibicuruzwa byatoranyijwe

source: TOTAL
rw: IGITERANYO CYOSE

source: View Cart
rw: Reba ububiko

source: Checkout
rw: Ishyura

source: Cameras
rw: Kamera

source: Accessories
rw: Inyongera

source: Contact
rw: Twandikire

source: hot deal this week
rw: Ibigezweho iki cyumweru

source: New Collection Up to 50%% OFF
rw: Ibikusanyo bishya bigeze 50%% OFF

source: Shop now
rw: Gura nonaha

source: Most Liked Products
rw: Ibicuruzwa bikunzwe

source: New Products
rw: Ibicuruzwa bishya

source: Top Selling Products
rw: Ibicuruzwa bigurishwa cyane

source: Login
rw: Injira

source: Welcome Again!
rw: Murakaza neza Nanone

source: Sign in to your account to continue
rw: Injira muri konti yanye kugirango ukomeze

source: Forgot password?
rw: Mwibagiwe ijambo ry'ibanga?

source: Don't have an account yet?
rw: Nta konti ufite?

source: Sign Up
rw: Iyandikishe

source: Password changed!
rw: Ijambo ry'ibanga ryahinduwe

source: You have successfully changed your password!. You may now proceed to log in.
rw: Ijambo ry'ibanga ryahinduwe!. Ubu wakomeza kwinjira

source: Return to Log in
rw: Subira kwinjira

source: Reset Password Done!
rw: Ihindurwa ry'ijambo ry'ibanga ryakozwe!

source: Hello!
rw: Muraho!

source: Type your email to reset you password
rw: Injiza imeri yawe uhindure ijambo ry'ibanga

source: Send reset email
rw: Ohereza imeri yo guhindura

source: Register
rw: Iyandikishe

source: Welcome !
rw: Murakaza neza

source: Cart
rw: Ububiko

source: Image
rw: Ishusho

source: Name
rw: Izina

source: Quantity
rw: Ingano

source: Price Unit
rw: Igiciro

source: S.Total
rw: IGITERANYO

source: Total Items
rw: Ibicuruzwa byose

source: Continue shopping
rw: Komeza ugure

source: Size
rw: Ingano

source: Color
rw: Ibara

source: Delivery
rw: Koherezwa

source: Category
rw: Ikiciro

source: share
rw: Sangiza abandi

source: Description
rw: Ubusobanuro

source: Reviews
rw: Ibonwa

source: Submit
rw: Ohereza

source: You may also like this
rw: Mushobora kuba mwakunda nibi

source: Results for
rw: Ibyabonetse kubijyanye na

source: No products yet
rw: Kugeza ubu nta bicuruzwa bihari

source: Wishlist
rw: Ibyo wifuza

source: Action
rw: Igikorwa

source: add to cart
rw: Ongera mu bubiko

source: remove
rw: Kuraho

source: You don't have products in your wishlist!!!!!
rw: Nta bicirishwa ufite kurutonde rw'ibyifuzo

source: Product
rw: igicuruzwa

source: Logout
rw: Sohoka

source: SUBTOTAL
rw: IGITERANYO CYOSE

source: Change Password
rw: Hindura ijambo ry'ibanga

source: Current Password
rw: Ijambo ry'ibanga risanzwe

source: New Password
rw: Ijambo ry'ibanga rishya

source: Confirm New Password
rw: Emeza ijambo ry'ibanga

source: Account Information
rw: Amakuru ya konti

source: Email
rw: Imeri

source: Gender
rw: Igitsina

source: Phone
rw: Terefone

source: City
rw: Umugi

source: Country
rw: Igihugu

source: Update
rw: Vugurura

source: Account
rw: Konti

source: Update Profile
rw: vugurura porofire

source: You don't have any Product in your cart!
rw: Nta bicuruzwa ufite kurutonde rw'ihaho

source: Total
rw: IGITERANYO

source: Actions
rw: Ibikorwa

source: You don't have any Product in your wishlist!
rw: Nta bicuruzwa ufite kurutonde rw'ibyifuzo
